go_control_flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-26 Thu 21:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Go: Control Flow</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pavel Vavilin" />
<meta name="keywords" content="Go" />
<link rel="stylesheet" type="text/css" href="solarized-dark.css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://pimiento.github.io/"> UP </a>
 |
 <a accesskey="H" href="https://pimiento.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">Go: Control Flow</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9c1ac72">1. If statement</a></li>
<li><a href="#org76d30bb">2. For loop</a></li>
<li><a href="#org49b333d">3. Switch case statement</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9c1ac72" class="outline-2">
<h2 id="org9c1ac72"><span class="section-number-2">1</span> If statement</h2>
<div class="outline-text-2" id="text-1">
<p>
Like for, the if statement can start with a short statement to execute before the condition. Variables declared by the statement are only in scope until the end of the if. Variables declared inside an if short statement are also available inside any of the else blocks.
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">if</span> answer != 42 {
        <span style="color: #00ff00; font-weight: bold;">return</span> <span style="color: #ffa500;">"Wrong answer"</span>
}
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">IF with a short statement</span>
<span style="color: #00ff00; font-weight: bold;">if</span> err := <span style="color: #00ffff; font-weight: bold;">foo</span>(); err != <span style="color: #7fffd4;">nil</span> {
        <span style="color: #b0c4de; font-weight: bold;">panic</span>(err)
}
<span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">IF and ELSE statement</span>
<span style="color: #00ff00; font-weight: bold;">if</span> v := math.<span style="color: #00ffff; font-weight: bold;">Pow</span>(2); v &lt; 3 {
        <span style="color: #00ff00; font-weight: bold;">return</span> <span style="color: #7fffd4;">false</span>
} <span style="color: #00ff00; font-weight: bold;">else</span> {
        <span style="color: #00ff00; font-weight: bold;">return</span> <span style="color: #7fffd4;">true</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org76d30bb" class="outline-2">
<h2 id="org76d30bb"><span class="section-number-2">2</span> For loop</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-go">sum := 0
<span style="color: #00ff00; font-weight: bold;">for</span> i := 0; i &lt; 10; i++ {
        sum += i
}
</pre>
</div>
<p>
For loop without pre/post statement
</p>
<div class="org-src-container">
<pre class="src src-go">sum := 1
<span style="color: #00ff00; font-weight: bold;">for</span> ; sum &lt; 1000; {
        sum += sum
}
</pre>
</div>
<p>
For loop as while loop
</p>
<div class="org-src-container">
<pre class="src src-go">sum := 1
<span style="color: #00ff00; font-weight: bold;">for</span> sum &lt; 1000 {
        sum += sum
}
</pre>
</div>
<p>
Infinite loop
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">for</span> {
        <span style="color: #5F7F5F;">// </span><span style="color: #ffa500; font-style: italic;">do something in a loop forever</span>
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org49b333d" class="outline-2">
<h2 id="org49b333d"><span class="section-number-2">3</span> Switch case statement</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>You can only compare values of the same type.</li>
<li>You can set an optional default statement to be executed if all the others fail.</li>
<li><p>
You can use an expression in the case statement, for instance you can calculate a value to use in the case:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        num := 3
        v := num % 2
        <span style="color: #00ff00; font-weight: bold;">switch</span> v {
        <span style="color: #00ff00; font-weight: bold;">case</span> 0:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"even"</span>)
        <span style="color: #00ff00; font-weight: bold;">case</span> 3 - 2:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"odd"</span>)
        }
}
</pre>
</div>

<pre class="example">
odd

</pre></li>
<li><p>
You can have multiple values in a case statement:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        score := 7
        <span style="color: #00ff00; font-weight: bold;">switch</span> score {
        <span style="color: #00ff00; font-weight: bold;">case</span> 0, 1, 3:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"Terrible"</span>)
        <span style="color: #00ff00; font-weight: bold;">case</span> 4, 5:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"Mediocre"</span>)
        <span style="color: #00ff00; font-weight: bold;">case</span> 6, 7:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"Not bad"</span>)
        <span style="color: #00ff00; font-weight: bold;">case</span> 8, 9:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"Almost perfect"</span>)
        <span style="color: #00ff00; font-weight: bold;">case</span> 10:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"hmm did you cheat?"</span>)
        <span style="color: #00ff00; font-weight: bold;">default</span>:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(score, <span style="color: #ffa500;">" off the chart"</span>)
        }
}
</pre>
</div>

<pre class="example">
Not bad

</pre></li>
<li><p>
You can execute all the following statements after a match using the fallthrough statement:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> <span style="color: #ffa500;">"fmt"</span>

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        n := 4
        <span style="color: #00ff00; font-weight: bold;">switch</span> n {
        <span style="color: #00ff00; font-weight: bold;">case</span> 0:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is zero"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 1:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 1"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 2:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 2"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 3:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 3"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 4:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 4"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 5:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 5"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 6:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 6"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 7:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 7"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 8:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is &lt;= 8"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">default</span>:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"Try again!"</span>)
        }
}
</pre>
</div>

<pre class="example">
is &lt;= 4
is &lt;= 5
is &lt;= 6
is &lt;= 7
is &lt;= 8
Try again!

</pre></li>
<li><p>
You can use a break statement inside your matched statement to exit the switch processing:
</p>
<div class="org-src-container">
<pre class="src src-go"><span style="color: #00ff00; font-weight: bold;">package</span> main

<span style="color: #00ff00; font-weight: bold;">import</span> (
        <span style="color: #ffa500;">"fmt"</span>
        <span style="color: #ffa500;">"time"</span>
)

<span style="color: #00ff00; font-weight: bold;">func</span> <span style="color: #00ffff; font-weight: bold;">main</span>() {
        n := 1
        <span style="color: #00ff00; font-weight: bold;">switch</span> n {
        <span style="color: #00ff00; font-weight: bold;">case</span> 0:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"is zero"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 1:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"&lt;= 1"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 2:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"&lt;= 2"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 3:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"&lt;= 3"</span>)
                <span style="color: #00ff00; font-weight: bold;">if</span> time.<span style="color: #00ffff; font-weight: bold;">Now</span>().<span style="color: #00ffff; font-weight: bold;">Unix</span>()%2 == 0 {
                        fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"un pasito pa lante maria"</span>)
                        <span style="color: #00ff00; font-weight: bold;">break</span>
                }
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 4:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"&lt;= 4"</span>)
                <span style="color: #00ff00; font-weight: bold;">fallthrough</span>
        <span style="color: #00ff00; font-weight: bold;">case</span> 5:
                fmt.<span style="color: #00ffff; font-weight: bold;">Println</span>(<span style="color: #ffa500;">"&lt;= 5"</span>)
        }
}
</pre>
</div>

<pre class="example">
&lt;= 1
&lt;= 2
&lt;= 3
&lt;= 4
&lt;= 5

</pre></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pavel Vavilin</p>
<p class="date">Created: 2017-10-26 Thu 21:21</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
